In [24]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 30, 35, 40, 28],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "San Francisco"],
    "Salary": [70000, 80000, 120000, 90000, 75000]
}

df = pd.DataFrame(data)
df

      Name  Age           City  Salary
0    Alice   25       New York   70000
1      Bob   30    Los Angeles   80000
2  Charlie   35        Chicago  120000
3    David   40        Houston   90000
4      Eve   28  San Francisco   75000

In [25]:
df[["Name", "City"]]

      Name           City
0    Alice       New York
1      Bob    Los Angeles
2  Charlie        Chicago
3    David        Houston
4      Eve  San Francisco

In [26]:
df[df["Age"] >= 30]

      Name  Age         City  Salary
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   40      Houston   90000

In [27]:
df["Country"] = "USA"
df

      Name  Age           City  Salary Country
0    Alice   25       New York   70000     USA
1      Bob   30    Los Angeles   80000     USA
2  Charlie   35        Chicago  120000     USA
3    David   40        Houston   90000     USA
4      Eve   28  San Francisco   75000     USA

In [28]:
df.loc[len(df)] = ["Frank", 33, "Seattle", 85000, "USA"]
df

      Name  Age           City  Salary Country
0    Alice   25       New York   70000     USA
1      Bob   30    Los Angeles   80000     USA
2  Charlie   35        Chicago  120000     USA
3    David   40        Houston   90000     USA
4      Eve   28  San Francisco   75000     USA
5    Frank   33        Seattle   85000     USA

In [29]:
df = df.drop(columns=["Salary"])
df

      Name  Age           City Country
0    Alice   25       New York     USA
1      Bob   30    Los Angeles     USA
2  Charlie   35        Chicago     USA
3    David   40        Houston     USA
4      Eve   28  San Francisco     USA
5    Frank   33        Seattle     USA

In [ ]:
df = df[df["Name"] != "David"]
df

      Name  Age           City Country
0    Alice   25       New York     USA
1      Bob   30    Los Angeles     USA
2  Charlie   35        Chicago     USA
4      Eve   28  San Francisco     USA
5    Frank   33        Seattle     USA

In [34]:
df["Salary"] = 5000

df.loc[df["Age"] >= 35, "Salary"] *= 1.05

df

C:\Users\Admin\AppData\Local\Temp\ipykernel_15132\2466619719.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Salary"] = 5000

      Name  Age           City Country  Salary
0    Alice   25         Boston     USA    5000
1      Bob   30    Los Angeles     USA    5000
2  Charlie   35        Chicago     USA    5250
4      Eve   28  San Francisco     USA    5000
5    Frank   33        Seattle     USA    5000

In [31]:
df.loc[df["Name"] == "Alice", "City"] = "Boston"
df

      Name  Age           City Country
0    Alice   25         Boston     USA
1      Bob   30    Los Angeles     USA
2  Charlie   35        Chicago     USA
4      Eve   28  San Francisco     USA
5    Frank   33        Seattle     USA

In [ ]:
df["Age"] = df["Age"].astype(float)
df["Salary"] = df["Salary"].astype(float)

df.dtypes

Name        object
Age        float64
City        object
Country     object
Salary     float64
dtype: object

C:\Users\Admin\AppData\Local\Temp\ipykernel_15132\2615651568.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"] = df["Age"].astype(float)
C:\Users\Admin\AppData\Local\Temp\ipykernel_15132\2615651568.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Salary"] = df["Salary"].astype(float)

In [ ]:
employee_data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['John', 'Emily', 'Sara', 'Tom', 'Anna'],
    'Department': ['HR', 'IT', 'Marketing', None, 'HR'],
    'Salary': [50000, 70000, None, 45000, 52000],
    'YearsAtCompany': [5, None, 8, 3, 4]
}

df_emp = pd.DataFrame(employee_data)

df_emp["Salary"] = df_emp["Salary"].fillna(df_emp["Salary"].mean())
df_emp["YearsAtCompany"] = df_emp["YearsAtCompany"].fillna(df_emp["YearsAtCompany"].mean())
df_emp

   EmployeeID   Name Department   Salary  YearsAtCompany
0         101   John         HR  50000.0             5.0
1         102  Emily         IT  70000.0             5.0
2         103   Sara  Marketing  54250.0             8.0
3         104    Tom       None  45000.0             3.0
4         105   Anna         HR  52000.0             4.0

In [43]:
product_data = {
    'ProductID': [1, 2, 3, 1, 4, 2],
    'ProductName': ['Laptop', 'Mouse', 'Monitor', 'Laptop', 'Keyboard', 'Mouse'],
    'Price': [1200, 25, 300, 1150, 45, 22],
    'QuantitySold': [10, 100, 50, 8, 70, 120]
}

df_prod = pd.DataFrame(product_data)

df_prod_sorted = df_prod.sort_values(by="Price", ascending=True)

df_prod_clean = df_prod_sorted.drop_duplicates(
    subset=["ProductID"],
    keep="first"
)

df_prod_clean

   ProductID ProductName  Price  QuantitySold
5          2       Mouse     22           120
4          4    Keyboard     45            70
2          3     Monitor    300            50
3          1      Laptop   1150             8

In [ ]:
car_data = {
    'Model': ['Sedan', 'SUV', 'Truck', 'Coupe', 'Convertible'],
    'Horsepower': [180, 250, 200, 170, 150],
    'MPG': [30, 20, 15, 35, 28],
    'Price': [30000, 45000, 40000, 28000, 32000]
}

df_car = pd.DataFrame(car_data)

low_hp3 = df_car.sort_values(by="Horsepower", ascending=True).head(3)

result = low_hp3.sort_values(by="MPG", ascending=False)

result

         Model  Horsepower  MPG  Price
3        Coupe         170   35  28000
0        Sedan         180   30  30000
4  Convertible         150   28  32000

In [48]:
football_data = {
    'PlayerID': [201, 202, 203, 204, 205],
    'Name': ['Ronaldo', 'Messi', 'Neymar', 'Mbappe', 'Kane'],
    'Position': ['Forward', 'Forward', 'Midfielder', 'Forward', 'Forward'],
    'GoalsScored': [600, 700, 400, 150, 200],
    'Age': [35, 33, 29, 22, 27]
}

df_football = pd.DataFrame(football_data)

filtered_players = df_football[
    (df_football["Position"] == "Forward") &
    (df_football["Age"] <= 30)
]

filtered_players

   PlayerID    Name Position  GoalsScored  Age
3       204  Mbappe  Forward          150   22
4       205    Kane  Forward          200   27

          TotalQuantity  TotalSales  Price
Product
Laptop                3        3600   1200
Monitor               2         600    300
Keyboard              2         200    100
Mouse                 7         175     25

UserID
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
dtype: int64